raibisch/ESP32_Luxtronik2/src/main.cpp
    SYS_IP = WiFi.localIP().toString();
    Serial.printf("IP Address: %s", SYS_IP);

    if (!ntpclient.begin(TimeZone, TimeServerLocal, TimeServer))
    {
     ESP.restart();
    }
   }
   else
   {
    Serial.println("INFO-WIFI:AP-Mode");
    WiFi.mode(WIFI_AP);
    WiFi.softAP("esp-luxtronik");   
    Serial.printf("IP Address: %s", WiFi.softAPIP().toString());
   }
}     

void testWiFiReconnect()
{
  // Test if wifi is lost from router
  if ((varStore.varWIFI_s_mode == "STA") && (WiFi.status() != WL_CONNECTED))
    {
     debug_println("Reconnecting to WiFi...");
     delay(300);
     if (!WiFi.reconnect())
     {
      delay(200);
      ESP.restart();
     } 
   }
}

#ifdef WEB_APP
// -------------------- WEBSERVER -------------------------------------------
// --------------------------------------------------------------------------

/*
Absturz:
TIME: 20:37:44
func:setHtmlVar: DEVICEID
func:setHtmlVar: DEVICEID
func:setHtmlVar: LUX_IP
func:setHtmlVar: DEVICEID
Guru Meditation Error: Core  1 panic'ed (InstrFetchProhibited). Exception was unhandled.

... tritt setzt nicht mehr auf

*/

/// @brief replace placeholder "%<variable>%" in HTML-Code
/// @param var 
/// @return String
String sLocal;
String setHtmlVar(const String& var)
{
  sLocal = "";
  debug_print("func:setHtmlVar: ");
  debug_println(var);
 
  if (var == "CONFIG") // read config.txt
  {
    if (!myFS.exists("/config.txt")) 
    {
     return String(F("Error: File 'config.txt' not found!"));
    }
    // read "config.txt" 
    fs::File configfile = myFS.open("/config.txt", "r");   
    String sConfig;     
    if (configfile) 
    {
      sConfig = readString(configfile);
      configfile.close();
    }
    else 
    { // no "config.txt"
      sConfig = "";
    }
    return sConfig;
  } 
  else
  if (var== "DEVICEID")
  {
    return varStore.varDEVICE_s_name;
  }
  else
  if (var == "INFO")
  {
     sLocal =    "Version    :";
     sLocal += SYS_Version;  
     sLocal += "\nPlatform   :";
     sLocal +=  ESP.getChipModel();
     sLocal += "\nBuild-Date :";
     sLocal +=  F(__DATE__);
     sLocal += "\nIP-Addr    :";
     sLocal += SYS_IP;
     sLocal += "\nRSSI       :";
     sLocal += WiFi.RSSI();
     sLocal += "\nTemp.      :";
     sLocal += temperatureRead();   
     sLocal += "\nFreeHeap   :";
     sLocal += ESP.getFreeHeap();
     sLocal += "\nMinFreeHeap:";
     sLocal += ESP.getMinFreeHeap();
#ifdef SG_READY
     sLocal += "\n\nEPEX NEXT DATE:";
     sLocal +=  smartgrid.getWebDate(true); //sEPEXdateNext;
     sLocal +=  "\n";
     sLocal += smartgrid.getWebHourValueString(true);

     sLocal += "\n\nEPEX TODAY:";
     sLocal +=  "\n";
     sLocal += smartgrid.getWebHourValueString(false); //sEPEXPriceToday;
     //sLocal += "\n---\n\n";
#endif
     return sLocal;
  }
#ifdef EPEX_PRICE
  else
  if (var =="PRICE_LOW")
  {
     return String(varStore.varEPEX_i_low);      
  }
 else
  if (var =="PRICE_HIGH")
  {
     return String(varStore.varEPEX_i_high);     
  }
  else
  if (var == "COST_MWST")
  {
    return String(varStore.varCOST_i_mwst);
  }
  else
  if (var == "COST_FIX")
  {
    return String(varStore.varCOST_f_fix);
  }
  else
  if (var == "EPEX_ARRAY")
  {
    //return  smartgrid.getWebHourValueString(false);                      //EPEXPriceToday; // jetzt TODAY !!!
    String ret = smartgrid.getWebHourValueString(false);
    if (smartgrid.getWebHourValueString(true).length() > 0)
    {
     ret += ", ";
     ret += smartgrid.getWebHourValueString(true);
    }
    return ret;
  }
  else
  if (var == "EPEX_DATE")
  {
    String ret = smartgrid.getWebDate(false);
    ret += "   -    ";
    ret += smartgrid.getWebDate(true);
    return ret;
  }
  else
  if (var == "SGMODE")
  {
    //switch (SmartGridReadyStatus)
    switch (smartgrid.getHour_iVarSGready(ntpclient.getTimeInfo()->tm_hour))
    {
    case 1:
      return "sg1";
      break;
    case 2:
      return "sg2";
      break;
    case 3:
      return "sg3";
      break;
    case 4:
      return "sg4";
      break;
    default:
      break;
    }
    return "";
  }
  else
  if (var == "SGHOURMODE")
  {
    for (size_t i = 0; i < SG_HOURSIZE; i++)
    {
#ifdef SHI_MODBUS
      sLocal += getSHIPCSetpoint(smartgrid.getHour_iVarSGready(i)); // new: 2025-04-16
#else
      sLocal += smartgrid.getHour_iVarSGready(i);
#endif
      if (i < SG_HOURSIZE-1)
      {
        sLocal += ',';
      }
    }
    //sLocal += '0';
    return sLocal;
  }
#ifdef CALC_HOUR_ENERGYPRICE
  else
  if (var == "COSTINFO")
  { 
     sLocal =      "Flex(ct):";
    sLocal += String((smartgrid.getUserkWhPrice(ntpclient.getTimeInfo()->tm_hour)),1);
    sLocal +=   "  Fix (cnt):";
    sLocal += String(smartgrid.getUserkWhFixPrice(),1);
   
    sLocal +=  " Hour-kWh : ";
    sLocal +=  String((smldecoder.getInputkWh() /* valSML_kwh_in */ - smartgrid.hourprice_kwh_start),3);

    sLocal += "\r\n\r\nHour-flex:";
    sLocal += String(smartgrid.getFlexprice_hour(ntpclient.getTimeInfo()->tm_hour),2);
  
    sLocal +=   "  Day-flex :";
    sLocal += String(smartgrid.getFlexprice_monthday(ntpclient.getTimeInfo()->tm_mday),2);
    
    sLocal +=    " Month-flex:";
    sLocal += String(smartgrid.getFlexprice_month(ntpclient.getTimeInfo()->tm_mon),2);

    //sLocal +=     "\r\nSum-flex     : ";
    //sLocal += String(smartgrid.Flexprice_sum + smartgrid.getAktFlexprice(),2);

    sLocal +=    "\r\nHour-fix: ";
    sLocal += String(smartgrid.getFixprice_hour(ntpclient.getTimeInfo()->tm_hour),2);

    sLocal +=     "  Day-fix  :";
    sLocal += String(smartgrid.getFixprice_monthday(ntpclient.getTimeInfo()->tm_mday),2);

    sLocal +=     "  Month-fix:";
    sLocal += String(smartgrid.getFixprice_month(ntpclient.getTimeInfo()->tm_mon) ,2);

    //sLocal +=     "\r\nSum-fix     : ";
    //sLocal += String(smartgrid.fixprice_sum + smartgrid.akt_fixprice,2);
    sLocal += "";

    return sLocal;
  }

  else
  if (var == "PRICE_FIX")
  {
     return String(smartgrid.getUserkWhFixPrice(),1);
  }

  else 
  if  (var == "PRICE_HOUR_FLEX")
  {
     for (size_t i = 0; i < 24; i++)
     {
      //sLocal += String(smartgrid.flexprice_hour[i],2);
      sLocal += String(smartgrid.getFlexprice_hour(i),2);
      if (i < 23)
      {
       sLocal += ", ";
      }
     }
     debug_println(sLocal);
     return sLocal;
  }
  else
  if (var == "PRICE_HOUR_FIX")
  {
     for (size_t i = 0; i <24; i++)
     {
      //sLocal += String(smartgrid.fixprice_hour[i],2);
      sLocal += String(smartgrid.getFixprice_hour(i),2);
      if (i < 23)
      {
       sLocal += ", ";
      }
     }
     return sLocal;
  }
  else
  if (var == "PRICE_MONTHDAY_FLEX")
  {
     for (size_t i = 1; i < 32; i++)
     {
      //sLocal += String(smartgrid.flexprice_monthday[i],2);
      sLocal += String(smartgrid.getFlexprice_monthday(i),2);
      if (i < 31)
      {
       sLocal += ", ";
      }
     }
     return sLocal;
  }
  else
  if (var == "PRICE_MONTHDAY_FIX")
  {
     for (size_t i = 1; i < 32; i++) // begin with "1" !!
     {
      //sLocal += String(smartgrid.fixprice_monthday[i],2);
      sLocal += String(smartgrid.getFixprice_monthday(i),2);
      if (i < 31)
      {
       sLocal += ", ";
      }
     }
     return sLocal;
  }
  else
  if (var == "PRICE_MONTH_FLEX")
  {
     for (size_t i = 0; i < 12; i++)
     {
      //sLocal += String(smartgrid.flexprice_month[i],2);
      sLocal += String(smartgrid.getFlexprice_month(i),2);
      if (i < 11)
      {
       sLocal += ", ";
      }
     }
     return sLocal;
  }
  else
  if (var == "PRICE_MONTH_FIX")
  {
     for (size_t i = 0; i < 12; i++)
     {
      //sLocal += String(smartgrid.fixprice_month[i],2);
      sLocal += String(smartgrid.getFixprice_month(i),2);
      if (i < 11)
      {
       sLocal += ", ";
      }
     }
     return sLocal;
  }
  else
  if (var == "COST_AKT_MONTH") // read config.txt
  {
    if (!myFS.exists("/cost_akt_month.txt")) 
    {
     return String(F("Error: File 'cost_akt_month.txt' not found!"));
    }
    // read "config.txt" 
    fs::File cfile = myFS.open("/cost_akt_month.txt", "r");   
    String sData;     
    if (cfile) 
    {
      sData = readString(cfile);
      cfile.close();
    }
    else 
    { // no "config.txt"
      sData = "";
    }
    return sData;
  }
  else
  if (var == "COST_AKT_YEAR") // read config.txt
  {
    if (!myFS.exists("/cost_akt_year.txt")) 
    {
     return String(F("Error: File 'cost_akt_year.txt' not found!"));
    }
    // read "config.txt" 
    fs::File cfile = myFS.open("/cost_akt_year.txt", "r");   
    String sData;     
    if (cfile) 
    {
      sData = readString(cfile);
      cfile.close();
    }
    else 
    { // no "config.txt"
      sData = "";
    }
    return sData;
  }
  #endif
  // EPEX_PRICE
  #endif 
  else
  if (var == "LUX_IP")
  {
    return varStore.varLUX_s_url;
  }
#ifdef SHI_MODBUS
  else
  if (var == "SHIHEOFFSET")
  {
    //return "1.0";
    return String(float(modbusSHI.getHeatOffsetX10()/10.0), 1);
  }
  else
  if (var == "SHIPCSETPOINT")
  {
    //return "1.6";
    return String(float(modbusSHI.getPCSetpoint())/10.0, 1);
  }
#endif

