raibisch/ESP32_Luxtronik2/src/main.cpp
  return "";
}


void notFound(AsyncWebServerRequest *request) 
{
    request->send(404, "text/plain", "Not found");
}

void initWebServer()
{ 
  
  sFetch.reserve(250);
  // --------------- Base Pages:----------------------------------
  //Route for root / web page
  webserver.on("/",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/index.html", String(), false, setHtmlVar);
  });
  //Route for root /index web page
  webserver.on("/index.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/index.html", String(), false, setHtmlVar);
  });
 
  //Route for setup web page
  webserver.on("/setup.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/setup.html", String(), false, setHtmlVar);
  });
  //Route for config web page
  webserver.on("/config.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/config.html", String(), false, setHtmlVar);
  });
  //Route for Info-page
  webserver.on("/info.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/info.html", String(), false, setHtmlVar);
  });

  // config.txt GET
  webserver.on("/reboot.html", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(404, "text/plain", "RESTART !");
    delay(300);
    //saveHistory();
    ESP.restart();
  });
  //----------------------------------------------------------------------

  // Temp Icons:
  webserver.on("/temp_inside.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/temp_inside.png", String(), false, setHtmlVar);
  });
  
  webserver.on("/temp_outside.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/temp_outside.png", String(), false, setHtmlVar);
  });

  //Route for Luxtronik details page
  webserver.on("/luxtronik.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/luxtronik.html", String(), false, setHtmlVar);
  });

  //Route for meter page
  webserver.on("/meter.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/meter.html", String(), false, setHtmlVar);
  });
  
  //.. some code for the navigation icons
  webserver.on("/home.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/home.png", String(), false);
  });
  webserver.on("/file-list.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/file-list.png", String(), false);
  });
  webserver.on("/settings.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(myFS, "/settings.png", String(), false);
  });

  webserver.on("/smartgrid.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(myFS, "/smartgrid.html", String(), false, setHtmlVar);
  });
  
#ifdef SG_READY
  webserver.on("/sgready.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(myFS, "/sgready.html", String(), false, setHtmlVar);
  });
  webserver.on("/reload.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/reload.png", String(), false);
  });
#endif

// Smart-Home-Interface --------------------------------
  webserver.on("/shi.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
#ifdef LUX_WEBSERVICE
    // !!! WORKAROUNT !!! ... bis neues JSON interface läuft
    luxws.setpollstate(WS_POLL_STATUS::NO_POLLING); 
    // !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
  #endif
    request->send(myFS, "/shi.html", String(), false, setHtmlVar);
  });

  webserver.on("/shi.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(myFS, "/shi.png", String(), false);
  });
  

  webserver.on("/fetch", HTTP_GET, [](AsyncWebServerRequest *request)
  {
                                                                      // Index:
    sFetch = ntpclient.getTimeString();                               // 0 = Time: 00:00
    sFetch += ",";
#ifdef SG_READY
    sFetch += smartgrid.getHour_iVarSGready(ntpclient.getTimeInfo()->tm_hour);// 1 = sg_status
#else
    sFetch += "-";
#endif
    sFetch += ',';
#ifdef LUX_WEBSERVICE
    sFetch += luxws.getval(LUX_VAL_TYPE::POWER_IN, true);       // 2 Power In
    sFetch += luxws.getCSVfetch(true);                          // 3...36 
#else
#ifdef SHI_MODBUS
    sFetch +=  modbusSHI.getWorkingMode();                      // 2 OFF, Heizung, Warmwasser, Abtauen
    sFetch += ',';
#ifdef DS100_MODBUS
    sFetch +=  valDS100_L1_W ;                                  // 3 Watt DS100 L1
    sFetch += ',';  
    sFetch += valDS100_L1_KWH;                                  // 4 kWh  DS100 L1
#else
    sFetch+= "0,0";
#endif
    sFetch += ',',
    sFetch += smldecoder.getWatt();                             // 5 Watt Hauptzaehler
    sFetch += ',';
    sFetch += (modbusSHI.getPower_InX100() * 100);              // 6 Luxtronik Watt IN
    sFetch += ',';
    sFetch += (modbusSHI.getPower_OutX100() * 100);             // 7 Luxtronik Watt OUT
    sFetch += ',';
    sFetch += (modbusSHI.getSumEnergy_InX100());                // 8 Luxtronik Sum kWh IN
    sFetch += ',';
    sFetch += (modbusSHI.getSumEnergy_OutX100());               // 9 Luxtronik Sum kWh OUT
    sFetch += ',';

    sFetch += tempRoom;                                         // 10 Celsius
    sFetch += ',';
    sFetch += (modbusSHI.getTempOutdoorX10() / 10.0);           // 11 Celsius
    sFetch += ',';
    
    sFetch += (modbusSHI.getTempWWX10() / 10.0);                // 12 Celsius
    sFetch += ',';
    sFetch += (modbusSHI.getRL_IstX10() / 10.0);                // 13 Celsius
    sFetch += ',';
    sFetch += (modbusSHI.getRL_SollX10() / 10.0);               // 14 Celsius
    sFetch += ',';
    sFetch += (modbusSHI.getVL_IstX10() / 10.0);                // 15 Celsius
#endif
    sFetch += ",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0";
#endif

    sFetch += ",end";     

