raibisch/ESP32_Luxtronik2/src/main.cpp
    /*  ----- !!! WORKAROUND !!! ...bis neues JSON Protokoll realisiert ist keine Websocket Kommunikation !!
    if (looptm->tm_min != old_minute) // Test min
    {
      old_minute = looptm->tm_min;
      luxws.setpollstate(WS_POLL_STATUS::SEND_LOGIN); 
    }

    // jede Stunde neuer Login, da bei Login immer die Bedienung direkt an der Steuerungs-Einheit gestört wird (springt in Menues)
    //if (looptm->tm_hour != old_hour) // Test new hour --> Luxtronik new Login sequence
    //{
    //  old_hour = looptm->tm_hour;
    //  luxws.setpollstate(WS_POLL_STATUS::SEND_LOGIN); 
    //}
    */

    if (looptm->tm_mday != old_day) // Test new Day --> reset dayly COP calculation
    { 
      _bNewDay = true;
      old_day = looptm->tm_mday;
    }

  #ifdef LUX_WEBSERVICE
    luxws.poll(_bNewDay);
    _bNewDay = false;
    if (luxws.isConnected())
    {
      AsyncWebLog.printf("WS-POLL-State:    \t %s\r\n", luxws.getval(LUX_VAL_TYPE::STATUS_POLL,     false));
      AsyncWebLog.printf("WP-State:         \t %s\r\n", luxws.getval(LUX_VAL_TYPE::STATUS_HEATPUMP, false));
      AsyncWebLog.printf("WP-PowerIn:       \t %s\r\n", luxws.getval(LUX_VAL_TYPE::POWER_IN, false));

      //debug_printf("[LUX]  Abschaltung: %s\r\n",        luxws.getval(LUX_VAL_TYPE::SWITCHOFF_INFO, false));
      //AsyncWebLog.printf("Watt                  \t %d \r\n",smldecoder.getWatt());
      //AsyncWebLog.printf("Leistung OUT-HEAT:    \t %s\r\n", luxws.getval(LUX_VAL_TYPE::ENERGY_OUT_HE, false));
    }
    else
    {
       AsyncWebLog.printf("...wait Luxtronik connecting\r\n");
    }
  #endif
    /*
    // for test :
    String s = ntpclient.getTimeString();
    s += ':';
    s += String(ntpclient.getTimeInfo()->tm_sec);
    mqtt.publish("luxtronik/time",s.c_str());
    */
  }

  // fast blink
  if (millis() - TimerFastDuration > TimerFast)
  {
    TimerFast = millis();
    blinkLED();
  }

}

